Autodesk.Revit.DB.IFC.ImporterIFCUtils.GetLocalFileName(Autodesk.Revit.DB.Document,System.String)
Get the local file name, including the path, corresponding to a linked IFC file.
This will create a local copy of the IFC file if necessary.
aDoc:
The document that will contain the IFC link.
fileName:
The original file name and path.
Returns:
The local file name and path corresponding to the input file name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Can't process file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018